Repository: ImperiulLianelor/timisoara-access-map
Catalog: app/translations/*/LC_MESSAGES/messages.po
Languages: ro

source: Access denied. Admin privileges required.
ro: Acces refuzat. Sunt necesare privilegii de administrator.

source: Admin Dashboard
ro: Panou de Administrare

source: Manage Locations
ro: Gestionare Locații

source: Pending Locations
ro: Locații în Așteptare

source: Location has been approved.
ro: Locația a fost aprobată.

source: Location has been rejected and deleted.
ro: Locația a fost respinsă și ștearsă.

source: Location has been updated.
ro: Locația a fost actualizată.

source: Edit Location
ro: Editare Locație

source: Manage Users
ro: Gestionare Utilizatori

source: You cannot change your own admin status.
ro: Nu vă puteți schimba propriul statut de administrator.

source: Admin status has been updated.
ro: Statutul de administrator a fost actualizat.

source: You cannot deactivate your own account.
ro: Nu vă puteți dezactiva propriul cont.

source: activated
ro: activat

source: deactivated
ro: dezactivat

source: User account has been %(status)s.
ro: Contul de utilizator a fost %(status)s.

source: Manage Reviews
ro: Gestionare Recenzii

source: Review has been deleted.
ro: Recenzia a fost ștearsă.

source: Admin Logs
ro: Jurnale Admin

source: Photo has been deleted.
ro: Fotografia a fost ștearsă.

source: Username
ro: Nume utilizator

source: Password
ro: Parolă

source: Remember Me
ro: Ține-mă minte

source: Sign In
ro: Autentificare

source: Repeat Password
ro: Repetă Parola

source: I use a wheelchair
ro: Folosesc un scaun cu rotile

source: I need visual assistance
ro: Am nevoie de asistență vizuală

source: I need hearing assistance
ro: Am nevoie de asistență auditivă

source: I need cognitive assistance
ro: Am nevoie de asistență cognitivă

source: Register
ro: Înregistrare

source: Please use a different username.
ro: Vă rugăm să folosiți un alt nume de utilizator.

source: Please use a different email address.
ro: Vă rugăm să folosiți o altă adresă de email.

source: Invalid username or password
ro: Nume de utilizator atau parolă invalidă

source: This account has been deactivated. Please contact an administrator.
ro: Acest cont a fost dezactivat. Vă rugăm contactați un administrator.

source: Login successful!
ro: Autentificare reușită!

source: You have been logged out.
ro: Ați fost deconectat.

source: Registration successful! You can now log in.
ro: Înregistrare reușită! Acum vă puteți autentifica.

source: Accessible Timisoara
ro: Timișoara Accesibilă

source: My Profile
ro: Profilul Meu

source: Name and location are required.
ro: Numele și locația sunt obligatorii.

source: Thank you! Your location has been submitted and will be reviewed shortly.
ro: Mulțumim! Locația dvs. a fost trimisă și va fi revizuită în curând.

source: Submit Location
ro: Trimite Locație

source: This location is not yet approved.
ro: Această locație nu este încă aprobată.

source: You cannot review a location that has not been approved yet.
ro: Nu puteți adăuga o recenzie pentru o locație care nu a fost încă aprobată.

source: Both review text and rating are required.
ro: recenzia și rating-ul sunt obligatorii.

source: Your review has been added. Thank you for contributing!
ro: Recenzia dvs. a fost adăugată. Mulțumim pentru contribuție!

source: My Dashboard
ro: Panoul Meu

source: Your accessibility preferences have been updated.
ro: Preferințele dvs. de accesibilitate au fost actualizate.

source: Current password is incorrect.
ro: Parola curentă este incorectă.

source: New passwords do not match.
ro: Parolele noi nu se potrivesc.

source: Your password has been updated.
ro: Parola dvs. a fost actualizată.

source: Timisoara Accessibility Map
ro: Harta Accesibilității Timișoara

source: Skip to content
ro: Sari la conținut

source: Timisoara Accessibility Map Homepage
ro: Pagina Principală Hartă Accesibilitate Timișoara

source: Timisoara Accessibility
ro: Accesibilitate Timișoara

source: Menu
ro: Meniu

source: Map
ro: Hartă

source: Dashboard
ro: Panou de control

source: Profile
ro: Profil

source: Logout
ro: Deconectare

source: Login
ro: Autentificare

source: Switch to Romanian
ro: Treci la Română

source: Switch to English
ro: Treci la Engleză

source: Close
ro: Închide

source: Helping people find accessible locations in Timisoara.
ro: Ajutăm oamenii să găsească locații accesibile în Timișoara.

source: Quick Links
ro: Link-uri Rapide

source: About
ro: Despre

source: Accessibility Guide
ro: Ghid de Accesibilitate

source: Accessibility
ro: Accesibilitate

source: This website is designed to be accessible for all users, including those with disabilities.
ro: Acest site web este conceput pentru a fi accesibil tuturor utilizatorilor, inclusiv celor cu dizabilități.

source: Toggle High Contrast
ro: Comutare Contrast Ridicat

source: Timisoara Accessibility Map. All rights reserved.
ro: Harta Accesibilității Timișoara. Toate drepturile rezervate.

source: Find Accessible Locations
ro: Găsește Locații Accesibile

source: Search for a location...
ro: Caută o locație...

source: Search for a location
ro: Caută o locație

source: Search
ro: Caută

source: Accessibility Needs
ro: Nevoi de Accesibilitate

source: Wheelchair
ro: Scaun cu rotile

source: Visual
ro: Vizual

source: Hearing
ro: Auditiv

source: Cognitive
ro: Cognitiv

source: Location Types
ro: Tipuri de Locații

source: Restaurants
ro: Restaurante

source: Cafés
ro: Cafenele

source: Shops
ro: Magazine

source: Attractions
ro: Atracții

source: Public Buildings
ro: Clădiri Publice

source: Transportation
ro: Transport

source: Healthcare
ro: Sănătate

source: Other
ro: Altele

source: Add New Location
ro: Adaugă o locație nouă

source: Please
ro: Vă rugăm

source: log in
ro: autentificați-vă

source: to add new locations.
ro: pentru a adăuga locații noi.

source: Map Legend
ro: Legendă Hartă

source: Wheelchair Accessible
ro: Accesibil Scaun cu Rotile

source: Visual Assistance
ro: Asistență Vizuală

source: Pending Approval
ro: În Așteptarea Aprobării

source: Accessibility map of Timisoara
ro: Harta accesibilității Timișoara

source: Close form
ro: Închide formular

source: Add New Accessible Location
ro: Adaugă Locație Nouă Accesibilă

source: Location Details
ro: Detalii Locație

source: Name
ro: Nume

source: Description
ro: Descriere

source: Address
ro: Adresă

source: Location Type
ro: Tip Locație

source: -- Select Type --
ro: -- Selectați Tipul --

source: Café
ro: Cafenea

source: Shop
ro: Magazin

source: Attraction
ro: Atracție

source: Public Building
ro: Clădire Publică

source: Accessibility Features
ro: Caracteristici de Accesibilitate

source: Has wheelchair ramp
ro: Are rampă pentru scaun cu rotile

source: Has accessible toilet
ro: Are toaletă accesibilă

source: Has accessible parking
ro: Are parcare accesibilă

source: Has accessible entrance
ro: Are intrare accesibilă

source: Has braille signage
ro: Are semnalizare Braille

source: Has audio guidance
ro: Are ghidaj audio

source: Has trained staff assistance
ro: Are asistență de la personal instruit

source: Photos
ro: Fotografii

source: Upload Photos (Max 3)
ro: Încarcă Fotografii (Max 3)

source: Max 5MB per photo. JPEG or PNG only.
ro: Max 5MB per fotografie. Doar JPEG sau PNG.

source: Photo Description
ro: Descriere Fotografie

source: Describe what the photos show
ro: Descrieți ce arată fotografiile

source: Cancel
ro: Anulează

source: Manage the Timisoara Accessibility Map platform.
ro: Gestionează Timișoara Access Map.

source: awaiting approval
ro: așteaptă aprobarea

source: Review Now
ro: Revizuiește Acum

source: Total Locations
ro: Total Locații

source: in database
ro: în baza de date

source: Users
ro: Utilizatori

source: registered users
ro: utilizatori înregistrați

source: Activity Logs
ro: Jurnale de Activitate

source: recent actions
ro: acțiuni recente

source: View All Logs
ro: Vezi Toate Jurnalele

source: Recent Activity
ro: Activitate Recentă

source: No recent activity found.
ro: Nu s-a găsit nicio activitate recentă.

source: Recent Locations
ro: Locații Recente

source: Type
ro: Tip

source: Status
ro: Statut

source: Submitted
ro: Trimis

source: Actions
ro: Acțiuni

source: Approved
ro: Aprobat

source: Pending
ro: În așteptare

source: View
ro: Vezi

source: Approve
ro: Aprobă

source: Reject
ro: Respinge

source: No recent locations found.
ro: Nu s-au găsit locații recente.

source: View All Locations
ro: Vezi Toate Locațiile

source: Back to Locations
ro: Înapoi la Locații

source: View Location
ro: Vezi Locația

source: Basic Information
ro: Informații de Bază

source: Location
ro: Locație

source: Latitude
ro: Latitudine

source: Longitude
ro: Longitudine

source: Current Photos
ro: Fotografii Curente

source: Delete
ro: Șterge

source: No photos available for this location.
ro: Nicio fotografie disponibilă pentru această locație.

source: Upload New Photos
ro: Încarcă Fotografii Noi

source: Describe what the new photos show
ro: Descrieți ce arată noile fotografii

source: Management
ro: Administrare

source: Submitted By
ro: Trimis de

source: Submission Date
ro: Data Trimiterii

source: Last Updated
ro: Ultima Actualizare

source: Mark as approved
ro: Marchează ca aprobat

source: Save Changes
ro: Salvează Modificările

source: Delete Location
ro: Șterge Locația

source: Confirm Deletion
ro: Confirmă Ștergerea

source: Are you sure you want to delete this location?
ro: Sunteți sigur că doriți să ștergeți această locație?

source: This action cannot be undone and will remove all associated photos and reviews.
ro: Această acțiune nu poate fi anulată și va elimina toate fotografiile și recenziile asociate.

source: Back to Dashboard
ro: Înapoi la Panoul de Control

source: All Types
ro: Toate Tipurile

source: All Statuses
ro: Toate Statusurile

source: Name or address
ro: Nume sau adresă

source: Filter
ro: Filtrează

source: Clear Filters
ro: Curăță Filtrele

source: Date
ro: Data

source: No address
ro: Fără adresă

source: Edit
ro: Editează

source: No locations found matching your criteria.
ro: Nu s-au găsit locații care să corespundă criteriilor dvs.

source: This action cannot be undone.
ro: Această acțiune nu poate fi anulată.

source: Admin Activity Logs
ro: Jurnale Activitate Admin

source: Action Type
ro: Tip Acțiune

source: All Actions
ro: Toate Acțiunile

source: Location Approval
ro: Aprobare Locație

source: Location Rejection
ro: Respingere Locație

source: Location Edit
ro: Editare Locație

source: Admin Grant
ro: Acordare Admin

source: Admin Revoke
ro: Revocare Admin

source: User Activation
ro: Activare Utilizator

source: User Deactivation
ro: Dezactivare Utilizator

source: Review Deletion
ro: Ștergere Recenzie

source: Photo Deletion
ro: Ștergere Fotografie

source: Admin User
ro: Utilizator Admin

source: All Admins
ro: Toți Adminii

source: Date Range
ro: Interval Datar

source: Start date
ro: Data de început

source: to
ro: până la

source: End date
ro: Data de sfârșit

source: Action
ro: Acțiune

source: IP Address
ro: Adresă IP

source: Details
ro: Detalii

source: Timestamp
ro: Marcaj Temporal

source: Previous
ro: Anterior

source: Page %(current)s of %(total)s
ro: Pagina %(current)s din %(total)s

source: Next
ro: Următor

source: No admin activity logs found matching your criteria.
ro: Nu s-au găsit jurnale de activitate admin care să corespundă criteriilor dvs.

source: All Locations
ro: Toate Locațiile

source: locations pending approval
ro: locații așteaptă aprobarea

source: Address:
ro: Adresă:

source: No address provided
ro: Nicio adresă furnizată

source: No description provided
ro: Nicio descriere furnizată

source: Accessibility:
ro: Accesibilitate:

source: Wheelchair ramp
ro: Rampă scaun cu rotile

source: Accessible toilet
ro: Toaletă accesibilă

source: Accessible entrance
ro: Intrare accesibilă

source: Audio guidance
ro: Ghidaj audio

source: Staff assistance
ro: Asistență personal

source: Submitted by:
ro: Trimis de:

source: Date:
ro: Data:

source: View Details
ro: Vezi Detalii

source: No locations pending approval.
ro: Nicio locație nu așteaptă aprobarea.

source: Great job! You're all caught up.
ro: Excelent! Sunteți la zi.

source: Are you sure you want to reject this location? This will permanently delete it.
ro: Sunteți sigur că doriți să respingeți această locație? Aceasta va fi ștearsă definitiv.

source: All Users
ro: Toți Utilizatorii

source: Active
ro: Activ

source: Inactive
ro: Inactiv

source: Admins
ro: Admini

source: Username or email
ro: Nume utilizator sau email

source: Role
ro: Rol

source: Joined
ro: Înscris la

source: User
ro: Utilizator

source: Needs wheelchair access
ro: Nevoie de acces cu scaunul cu rotile

source: Needs visual assistance
ro: Nevoie de asistență vizuală

source: Needs hearing assistance
ro: Nevoie de asistență auditivă

source: Needs cognitive assistance
ro: Nevoie de asistență cognitivă

source: Remove admin role
ro: Elimină rolul de admin

source: Make admin
ro: Fă admin

source: Deactivate user
ro: Dezactivează utilizator

source: Activate user
ro: Activează utilizator

source: Current user
ro: Utilizator curent

source: No users found matching your criteria.
ro: Nu s-au găsit utilizatori care să corespundă criteriilor dvs.

source: Are you sure you want to remove admin privileges from this user?
ro: Sunteți sigur că doriți să eliminați privilegiile de admin pentru acest utilizator?

source: Are you sure you want to grant admin privileges to this user?
ro: Sunteți sigur că doriți să acordați privilegii de admin acestui utilizator?

source: Are you sure you want to deactivate this user? They will not be able to log in.
ro: Sunteți sigur că doriți să dezactivați acest utilizator? Acesta nu se va mai putea autentifica.

source: Are you sure you want to activate this user?
ro: Sunteți sigur că doriți să activați acest utilizator?

source: Don't have an account?
ro: Nu aveți cont?

source: Create an Account
ro: Creează un Cont

source: Accessibility Preferences
ro: Preferințe de Accesibilitate

source: Already have an account?
ro: Aveți deja un cont?

source: Log In
ro: Autentifică-te

source: Yes
ro: Da

source: No
ro: Nu

source: Accessible parking
ro: Parcare accesibilă

source: Braille signage
ro: Semnalizare Braille

source: Reviews
ro: Recenzii

source: No reviews yet. Be the first to review this location!
ro: Nicio recenzie încă. Fii primul care adaugă o recenzie acestei locații!

source: Add Your Review
ro: Adaugă o recenzie

source: stars
ro: stele

source: Your Review
ro: Recenzia Ta

source: Submit Review
ro: Trimite Recenzie

source: to add a review.
ro: pentru a adăuga o recenzie.

source: Reviews can only be added once this location has been approved.
ro: Recenziile pot fi adăugate doar după ce această locație a fost aprobată.

source: Get Directions
ro: Obține Indicații

source: Edit as Admin
ro: Editează ca Admin

source: Submit Accessible Location
ro: Adauga o locație accesibilă

source: Help others by sharing accessible locations in Timisoara.
ro: Ajută-i pe alții împărtășind locații accesibile în Timișoara.

source: The name of the location (e.g. "Central Park Restaurant")
ro: Numele locației (ex. "Restaurant Parcul Central")

source: A brief description of the location and its accessibility features
ro: O scurtă descriere a locației și a caracteristicilor sale de accesibilitate

source: Or select a location on the map:
ro: Sau selectați o locație pe hartă:

source: Use My Current Location
ro: Folosește Locația Mea Curentă

source: Adding descriptions helps users with visual impairments.
ro: Adăugarea descrierilor ajută utilizatorii cu deficiențe de vedere.

source: Welcome back,
ro: Bine ai revenit,

source: My Locations
ro: Locațiile Mele

source: Wheelchair accessible
ro: Accesibil scaun cu rotile

source: Braille available
ro: Braille disponibil

source: You haven't added any locations yet.
ro: Nu ați adăugat încă nicio locație.

source: Add Your First Location
ro: Adaugă prima ta locație

source: My Reviews
ro: Recenziile Mele

source: You haven't written any reviews yet.
ro: Nu ați scris încă nicio recenzie.

source: Find Places to Review
ro: Găsește Locuri de Recenzat

source: Member since
ro: Membru din

source: Wheelchair access
ro: Acces scaun cu rotile

source: Visual assistance
ro: Asistență vizuală

source: Hearing assistance
ro: Asistență auditivă

source: Cognitive assistance
ro: Asistență cognitivă

source: Edit Profile
ro: Editează Profilul

source: Your Activity
ro: Activitatea Ta

source: Locations
ro: Locații

source: Locations Added
ro: Locații Adăugate

source: Account Settings
ro: Setări Cont

source: Email Address
ro: Adresă de Email

source: Preferred Language
ro: Limbă Preferată

source: Romanian
ro: Română

source: English
ro: Engleză

source: Select options below to customize your experience and filter locations by your needs.
ro: Selectați din opțiunile de mai jos pentru a vă personaliza experiența și pentru a filtra locațiile după nevoile dvs.

source: Show locations with ramps, accessible entrances, and parking
ro: Afișează locații cu rampe, intrări accesibile și parcare

source: Show locations with braille signage and audio guidance
ro: Afișează locații cu semnalizare Braille și ghidaj audio

source: Show locations with visual alerts and staff trained in sign language
ro: Afișează locații cu alerte vizuale și personal instruit în limbajul semnelor

source: Show locations with simplified navigation and staff assistance
ro: Afișează locații cu navigație simplificată și asistență din partea personalului

source: Save Preferences
ro: Salvează Preferințele

source: Change Password
ro: Schimbă Parola

source: Current Password
ro: Parola Curentă

source: New Password
ro: Parolă Nouă

source: Password must be at least 8 characters with letters and numbers
ro: Parola trebuie să conțină cel puțin 8 caractere, cu litere și cifre

source: Confirm New Password
ro: Confirmă Parola Nouă
